Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/basics.po
Languages: ru

source: Basics
ru: Основы

source: Basic unit is Team. Inside the team there are contacts, tasks, group chats. Contact from one team cannot interact with contact from another team.
ru: Работа ведется в командах. Внутри команды есть контакты, задачи, групповые чаты. Контакт из одной команды не может просто так общаться с контактом из другой.

source: Each user in the team has an identifier in the form of ``d-<UID>``. For historical reasons it is called ``JID``.
ru: Каждый пользователь в команде имеет идентификатор вида ``d-<UID>`` . По историческим причинам он называется ``JID`` .

source: The number of ``JID`` that user has depends on how many teams they are a part of. If the user is a part of 3 teams they have 3 ``JID`` s. If the user is new they have no ``JID`` s.
ru: В скольких командах состоит пользователь, столько у него и ``JID`` . Если пользователь состоит в 3 командах, у него 3 ``JID`` . Если пользователь новый, то ``JID`` у него еще нет.

source: ``is_archive`` field
ru: Поле ``is_archive``

source: Nothing get deleted from the database. Instead the ``is_archive`` flag will be set. The exception are devices.
ru: Из системы ничего не удаляется, просто выставляется флаг ``is_archive`` . Исключение: устройства.

source: ``can_*`` fields
ru: Поля ``can_*``

source: When a reply is received from a request there maybe an additional fields in the form of ``can_DO_SOMETHING``. They mean "can I do something with the returned object?"
ru: Если известно, кто запрашивает объект, у него появляются дополнительные поля ``can_ЧТО-НИБУДЬ`` . Они означают, «могу ли я, *запрашивающий*, делать с этим объектом ЧТО-НИБУДЬ».

source: Examples:
ru: Примеры:

source: ``{"can_send_message": false}`` in the self profile means that you can't send message to yourself.
ru: ``{"can_send_message": false}`` в своем профиле означает, что я НЕ могу послать себе сообщение.

source: ``{"can_add_to_team": true}`` in the team means that you can add new participants to the team. (maybe you are the admin or owner)
ru: ``{"can_add_to_team": true}`` в команде означает, что я МОГУ добавлять новых участников в команду (вероятно я администратор, а может владелец)

source: In reality those fields to not exists in database - they are calculated on the fly.
ru: В реальности этих полей в базе не существует — они вычисляются на лету.

source: They are needed to ensure that the logic is stored in a single place.
ru: Для чего это надо: чтобы логика была по-максимуму в одном месте.

source: For example, we decided that its possible to send yourself a message. We only need to change the server now without any additional changes. Both web and mobile clients will change their logic.
ru: Например, мы решаем, что теперь можно слать себе сообщения. Немного изменяем сервер, и если приложения проверяли не «это я себе пишу, или не себе пишу», а тупо смотрели на флаг ``can_send_message`` , то больше никаких изменений вносить не надо: оба мобильных клиента и веб-клиент сразу меняют свою логику.

source: Second example, eventually we might add new administrator role with tunnable rights. Using the can_* flags it will be backward compatible.
ru: Второй пример: мы можем когда-нибудь завести новую сущность «администратор с настраиваемыми правами». При использовании флагов ``can_*`` можно про это не думать: в старых приложениях ничего не сломается.

source: In the server root there is a ``/features.json`` file with fields that depend on installation. On different nodes different features might be enabled.
ru: В корне есть файл ``features.json`` с полями, которые зависят от инсталляции. На разных нодах могут быть включены разные возможности.

source: This file is not a part of API. API might have version changes, old APIs might get disabled but this file will always be present.
ru: Файл не является частью API. У API может меняться версия, старые версии могут отключаться, меняться способ авторизации. А этот файл будет на этом месте всё время.

source: There is also ``features.js`` wrapper. If you run it as script it will automatically create window.FEATURES.
ru: Также есть обёртка ``features.js`` . Достаточно включить её как скрипт, и она создаст window.FEATURES.
