Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/chat_paths.po
Languages: ru

source: Chat related paths
ru: Пути относящиеся в чатам

source: Get the chat information.
ru: Получить информацию чата.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__chats__chat_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__chats__chat_id_>`__

source: Parameters
ru: Параметры

source: ID of the team.
ru: ID команды.

source: ID of the chat.
ru: ID чата.

source: Response JSON Object
ru: JSON объект ответа

source: True if no error occured.
ru: True если не было ошибки

source: The :tdproto:ref:`Chat` object.
ru: Новый :tdproto:ref:`Chat` объект.

source: Status Codes
ru: Код статуса

source: No error.
ru: Без ошибки

source: Change chat settings.
ru: Изменить настройки чата.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/put_api_v4_teams__team_id__chats__chat_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/put_api_v4_teams__team_id__chats__chat_id_>`__

source: Request JSON Object
ru: JSON объект запроса.

source: The :tdproto:tdmodels:`Chat` object.
ru: :tdproto:ref:`Chat` объект.

source: Send text message to chat.
ru: Послать сообщение в чат.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__chat_id__messages>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__chat_id__messages>`__

source: The :tdproto:tdmodels:`Message` object.
ru: :tdproto:ref:`Message` объект.

source: Edit message.
ru: Изменить сообщение.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__chat_id__messages__message_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__chat_id__messages__message_id_>`__

source: ID of the message.
ru: ID сообщения.

source: The :tdproto:ref:`Message` object.
ru: :tdproto:ref:`Message` объект.

source: Delete message.
ru: Удалить сообщение.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__chats__chat_id__messages__message_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__chats__chat_id__messages__message_id_>`__

source: Send text message to direct chat.
ru: Послать сообщение в прямой чат.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__contact_id__messages>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__contact_id__messages>`__

source: ID of the contact.
ru: ID контакта.

source: Edit message in direct chat.
ru: Изменить сообщение в прямом чате.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__contact_id__messages__message_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__chats__contact_id__messages__message_id_>`__

source: Delete message in direct chat.
ru: Удалить сообщение из прямого чата.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__chats__contact_id__messages__message_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__chats__contact_id__messages__message_id_>`__
