Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/data_index.po
Languages: ru

source: Enums index
ru: Индекс Enum

source: **Possible values**:
ru: **Возможные значения**:

source: Type aliases
ru: Псевдонимы типов

source: **Base Type**: ActiveUserDailyStat
ru: **Изначальный тип**: ActiveUserDailyStat

source: **Is array**
ru: **Является списком**

source: Bot commands list
ru: Список команд ботов

source: **Base Type**: string
ru: **Базовый тип**: string

source: Date and time in RFC3339 format. Example: ``2019-09-18T00:00:07.435409Z``
ru: Дата и время в RFC3339 формате. Пример: ``2019-09-18T00:00:07.435409Z``

source: **Base Type**: MessageLink
ru: **Базовый тип**: MessageLink

source: **Base Type**: int
ru: **Базовый тип**: int

source: Color in ``#rrggbb`` format where ``rr``, ``gg``, ``bb`` are hexadecimal numbers from 00 to ff of red, green and blue channels correspondingly. (yellow would be ``#ffff00``)
ru: Цвет в ``#rrggbb`` формате где ``rr``, ``gg``, ``bb`` шестнадцатеричные цифры от 00 до ff красного, зеленого и синего канала соответственно. (например желтый будет ``#ffff00``)

source: #-links autocomplete response
ru: Самозаполнения имен чатов

source: **Base Type**: SharpLink
ru: **Базовый тип**: SharpLink

source: JSON objects index
ru: Индекс JSON объектов

source: Bot commands information
ru: Информация о команде бота

source: Fields:
ru: Поля:

source: What should be inserted to the chat
ru: Что должно быть вставлено в чат

source: Maybe omitted
ru: Возможно поле будет отсутствовать

source: Might be null
ru: Возможен null

source: What should be visible by user
ru: Что должно быть видимо пользователем

source: Command options, if any
ru: Опции команды если существует

source: ButtonColors button colors for app
ru: Цвета кнопок для приложения

source: Brand static color
ru: статический цвет

source: Brand active color
ru: активный цвет

source: Brand disable color
ru: отключенный цвет

source: Simple static color
ru: простой статический цвет

source: Simple active color
ru: простой активный цвет

source: Simple disable color
ru: простой отключенный цвет

source: Call participant device
ru: Устройство участника звонка

source: Device muted
ru: устройство заглушено

source: Device description
ru: Описание устройства

source: Call participant
ru: Участник звонка

source: Contact id
ru: Id контакта

source: Contact name
ru: Имя контакта

source: Contact role
ru: Роль контакта

source: Contact icon
ru: Иконка контакта

source: Microphone muted. Computed from devices muted states
ru: Микрофон выключен. Вычисляется из состояния устройств

source: Member devices, strictly one for now
ru: Устройства участвующие, строго одно пока-что

source: Chat (direct, group, task) representation
ru: Образ чата. (прямого, группового или задачного)

source: Group/Task/Contact id
ru: Id группы/задачи/контакта

source: Chat type
ru: Тип чата

source: Base fields (not related to concrete participant) version
ru: Базовые поля (не относящиеся к каким либо участникам) версия

source: Chat fields related to concrete participant) version
ru: Поля чата относящиеся к какому либо конкретному участнику версия

source: Creation date, iso datetime
ru: Дата создания, iso datetime

source: Title
ru: Титул

source: Icons info
ru: Данные иконки

source: Include unread messages to counters
ru: Непрочитанные сообщения будут учитываться в счетчике

source: Can I call to this chat
ru: Могу ли я звонить в этот чат

source: Can I send message to this chat
ru: Могу ли я отправлять сообщения в этот чат

source: Why I can't send message to this chat (if can't)
ru: Почему я не могу отправлять сообщения в этот чат (если не могу)

source: Description collapsed. Used for tasks only
ru: Сжатое описание. Используется только в задачах

source: Last message draft, if any
ru: Черновик последнего сообщения, если существует

source: Last message draft version, if any
ru: Версия последнего черновика , если существует

source: Hidden chat
ru: Невидимый чат

source: Push notifications enabled
ru: Пуш уведомления включены

source: Number of important messages
ru: Число важных сообщений

source: Unread counter
ru: Счетчик непрочитаных сообщений

source: Mentions (@) counter
ru: Счетчик упоминаний (@)

source: Last message object
ru: Объект последнего сообщения

source: Last read message id, if any
ru: Id последнего прочитанного сообщения, если существует

source: Project / section id, if any
ru: Id проекта / секции , если существует

source: List of editable fields
ru: Список редактируемых полей

source: Is chat pinned on top
ru: Закреплен ли чат на верху

source: Sort ordering for pinned chat
ru: Тип сортирования прикрепленного чата

source: Non-archive participants number
ru: Количество не архивированных участников

source: Can I delete this chat
ru: Могу ли я удалить этот чат

source: Group or task description
ru: Описание группы или задачи

source: Markup entities for description field. Experimental
ru: Markup объекты для описания. Экспериментально

source: Present in feed (main screen)
ru: Существует в feed (главный экран)

source: Pinned message for this chat
ru: Прикрепленные сообщения этого чата

source: Custom color index from table of colors. Tasks only
ru: Индекс нестандартного цвета из таблицы цветов. Только в задачах

source: Items in checklist. Tasks only
ru: количество пунктов в чеклисте. Только в задачах

source: Checked items in checklist. Tasks only
ru: Количество отмеченных пунктов в чеклисте. Только в задачах

source: Assignee contact id. Tasks only
ru: Id доверенного контакта. Только в задачах

source: Task number in this team
ru: Номер задачи в этой команде

source: Task followers id's. TODO: rename to "followers"
ru: Id подписчиков

source: Task creator
ru: Создатель задачи

source: Task status. May be custom
ru: Статус задачи. Возможно не стандартное

source: Task title. Generated from number and description
ru: Титул задачи. Создается из номера и описания

source: Task done date in iso format, if any
ru: Дата завершения задачи в iso формате, если существует

source: Task done reason, if any
ru: Причина завершения задачи, если существует

source: Task deadline in iso format, if any
ru: Дедлайн задачи в iso формате, если существует

source: Is task deadline expired
ru: Просрочен ли дедлайн

source: Links in description
ru: Ссылки в описании

source: Task tags list, if any
ru: Список тэгов задачи, если существуют

source: Task importance, if available in team
ru: Важность задачи, если доступно в команде

source: Task urgency, if available in team
ru: Срочность задачи, если доступно в команде

source: Task spent time, number
ru: Время затраченное на задачу

source: Task complexity, number
ru: Сложность задачи

source: Used for "Create task from messages..."
ru: Используется для «Create task from messages…»

source: Upload uids for request, upload objects for response
ru: UID загрузок для запроса, объекты загрузок для ответа

source: Checklist items. Task only
ru: Предметы чеклиста. Только в задачах

source: Parent tasks
ru: Родительские задачи

source: Tab names
ru: Имена закладок

source: My status in group chat
ru: Мой статус в группе

source: Group chat members
ru: Участники группового чата

source: Can I add member to this group chat
ru: Могу ли я добавлять участников в этот групповой чат

source: Can I remove member from this group chat
ru: Могу ли я убирать участников из этого группового чата

source: Can I change member status in this group chat
ru: Могу ли я менять статус участников этого группового чата

source: deprecated: use changeable fields
ru: арело: используете ``changeable fields``

source: Any new team member will be added to this group chat
ru: Будут ли новые участники добавлены в этот чат при создании

source: Readonly for non-admins group chat (Like Channels in Telegram but switchable)
ru: Только для чтения для не администраторов (как каналы в Telegram но переключаемые)

source: Delete messages in this chat in seconds. Experimental function
ru: Удалять сообщения через столько то секунд. Экспериментальная функция

source: Can other team member see this task/group chat
ru: Могут ли другие участники команды видеть этот чат/задачу

source: Can I join to this public group/task
ru: Могу ли я присоединиться к этому публичному чату/задаче

source: Can I delete any message in this chat
ru: Могу ли я удалять сообщения в этом чате

source: Can I change Important flag in any message in this chat
ru: Могу ли я менять флаг важности сообщений в этом чате

source: Date of the last message sent even if it was deleted
ru: Дата последнего сообщения в этом чате если оно было удалено

source: Deprecated
ru: Устарело

source: Minimal chat representation
ru: Минимальное представление чата

source: Icon data
ru: Данные иконки

source: Set of rules to apply to tasks for coloring
ru: Набор правил о применении цветов к задачам

source: Rule id
ru: Id правила

source: Rule priority
ru: Приоритет правила

source: Rule description
ru: Описание правила

source: Color index
ru: Индекс цвета

source: Project filter enabled
ru: Фильтр проектов включен

source: Project id if project filter enabled
ru: Id проекта если фильтр по проектам включен

source: Tags filter enabled
ru: Фильтр по тэгам включен

source: Tag ids if tags filter enabled
ru: Тэги если фильтр по тэгам включен

source: Task status
ru: Статус задачи

source: Task importance filter enabled
ru: Фильтр по важности включен

source: Task importance if task importance filter enabled
ru: Важность задачи если фильтр по важности включен

source: Task urgency filter enabled
ru: Фильтр по срочности включен

source: Task urgency if task urgency filter enabled
ru: Срочность задачи если фильтр по срочности включен

source: Contact Id
ru: Id контакта

source: Node uid for external users
ru: uid узла для внешних пользователей

source: Full name in chats
ru: Полное имя в чатах

source: Short name in chats
ru: Короткое имя в чатах

source: Contact email in this team
ru: Контактный email в этой команде

source: Contact phone in this team
ru: Контактный телефон в этой команде

source: Icons data
ru: Данные иконки

source: Object version
ru: Версия объекта

source: Role in this team
ru: Роль этой команде

source: Mood in this team
ru: Настроение в этой команде

source: Status in this team
ru: Статус в этой комманде

source: Last activity in this team (iso datetime)
ru: Последняя активность в этой команде (iso дата-время)

source: Contact deleted
ru: Пользователь был удален

source: Bot name. Empty for users
ru: Имя бота. Пустое для пользователей

source: Section ids
ru: Id секции

source: Can I send message to this contact
ru: Могу ли я отправлять сообщения этому контакту

source: Can I call to this contact
ru: Могу ли я звонить этому контакту

source: Can I create task for this contact
ru: Могу ли я создавать задачи этому контакту

source: Can I import tasks in this team
ru: Могу ли я импортировать задачи в этой команде

source: Can I add this contact to group chats
ru: Могу ли я добавлять этого контакта в групповые чаты

source: Can I remove this contact from team
ru: Могу ли я убрать этот контакт из команды

source: Changeable fields
ru: Изменяемые поля

source: Family name
ru: Фамилия

source: Given name
ru: Имя

source: Patronymic, if any
ru: Отчество если существует

source: Default language code
ru: Код языка по умолчанию

source: Enable debug messages in UI
ru: Включить отладочные сообщения в интерфейсе

source: Enable remove all messages experimental features
ru: Включить экспериментальную функцию убрать все сообщения

source: Use Ctrl/Cmd + Enter instead Enter
ru: Использовать Ctrl/Cmd + Enter вместо Enter

source: Use * as @ for mentions
ru: Использовать Ctrl/Cmd + Enter вместо Enter

source: Send push notifications even contact is online
ru: Посылать пуш уведомления даже если контакт онлайн

source: Hide pushes body
ru: Скрывать тело пушей

source: Timezone, if any
ru: Часовой пояс

source: Quiet time start
ru: Начало тихого времени

source: Quiet time finish
ru: Окончание тихого времени

source: Focus mode enabled until
ru: Режим фокусировки включен до

source: Push notifications for group chats
ru: Пуш уведомления для групповых чатов

source: Push notifications for task chats
ru: Пуш уведомления для задач

source: Short view in contact list
ru: Короткий список контактов

source: Short view in group list
ru: Короткий список групп

source: Short view in task list
ru: Короткий список задач

source: Short view in contact list in mobile app
ru: Короткий список контактов в мобильном приложении

source: Short view in group list in mobile app
ru: Короткий список групп в мобильном приложении

source: Two-factor authentication is configured and confirmed
ru: Двух факторная аутентификация настроена и подтверждена

source: Two-factor authentication status
ru: Статус двух факторной аутентификации

source: Short view in task list in mobile app
ru: Короткий список задач в мобильном приложении

source: Show archived contacts in contact list
ru: Показывать архивированных контактов в списке контактов

source: Show unread chats first in feed
ru: Показывать непрочитанные чаты в списке чатов первыми

source: Show unread chats first in feed in mobile app
ru: Показывать непрочитанные сообщения первыми в мобильном приложении

source: Can I add new members to this team
ru: Могу ли я добавлять новых пользователей в эту команду

source: Can I manage contact sections in this team
ru: Могу ли я управлять секциями в этой команде

source: Can I manage task projects in this team
ru: Могу ли управлять проектами в этой команде

source: Can I manage tags in this team
ru: Могу ли я управлять тэгами в этой команде

source: Can I manage integrations in this team
ru: Могу ли я управлять интеграциями в этой команде

source: Can I manage color rules in this team
ru: Могу ли я управлять правилами цветов в этой команде

source: Can I create group chats in this team
ru: Могу ли я управлять групповыми чатами в этой команде

source: Can I view/join public group in this team
ru: Могу ли я видеть/присоединяться к публичным группам в этой команде

source: Can I view/join public tasks in this team
ru: Могу ли я видеть/присоединяться к публичным задачам в этой команде

source: Extra contact fields
ru: Дополнительные поля контактов

source: Company
ru: Компания

source: Department
ru: Департамент

source: MobilePhone
ru: Мобильный телефон

source: Import source
ru: Источник импорта

source: User UUID in Active Directory
ru: UUID пользователя в Active Directory

source: Short contact representation
ru: Компактное отображение контакта

source: Country for phone numbers selection on login screen
ru: Государство для отображения телефонных номеров на странице логина

source: Phone code
ru: Код номера телефона

source: Country ISO code
ru: ISO код государства

source: Country name
ru: Имя государства

source: Selected by default
ru: Выбрано по умолчанию

source: Is popular, need to cache
ru: Популярно значит должно быть кэшировано

source: Minimal chat representation for deletion
ru: ``text`` (string) - Текстовое представление чата

source: Chat fields (related to concrete participant) version
ru: Поля чата (относящиеся к какому либо конкретному участнику) версия

source: Archive flag. Always true for this structure
ru: Флаг архивирования. Всегда true для этой структуры

source: Remind deleted message
ru: Напомнить об удаленном сообщении

source: Remind id
ru: Id напоминания

source: Deleted task project or contact section
ru: Удаленная задача, проект или контакт

source: Section uid
ru: Uid секции

source: Delete tag message
ru: Удаленный тэг сообщения

source: Tag id
ru: Id тэга

source: Team deletion message. Readonly
ru: Сообщение удаления команды. Только для чтения

source: Team id
ru: Id команды

source: Team deleted
ru: Команда была удалена

source: Simple api for integrations /api/message or /tasks/[team]/[num]/message
ru: Простое api для интеграций с /api/message или /tasks/[team]/[num]/message

source: Comma separated api keys (for /api/message calls only)
ru: Ключи API разделенные запятыми (только для /api/message)

source: Message text. Required
ru: Текст сообщения. Обязательно

source: Message uuid. Optional
ru: Uid сообщения. Обязательно

source: Disable links preview
ru: Отключить предварительный просмотр ссылок

source: Mark message as important
ru: Отметить сообщение важным

source: Disable counters and push notifications
ru: Отключить счетчики и пуш уведомления

source: Convert "\\n" to "\n"
ru: Конвертировать "\\n" в "\n"

source: Unicode symbol
ru: Юникод символ

source: Text representation
ru: Текстовая репрезентация

source: Server information. Readonly
ru: Информация о сервере. Только для чтения.

source: Current host
ru: Текущий хост

source: Build/revision of server side
ru: Версия компиляции сервера

source: Desktop application version
ru: Версия приложения рабочего стола

source: Webclient version
ru: Версия веб приложения

source: Application title
ru: Титул приложения

source: Landing page address, if any
ru: Адрес изначальной страницы

source: Local applications urls
ru: Ссылки локальных приложений

source: Static files server address
ru: Адрес сервера с статическими файлами

source: Link to AppStore
ru: Ссылка в AppStore

source: Link to Google Play
ru: Ссылка в Google Play

source: Link to AppStore for corporate app
ru: Ссылка в AppStore для корпоративного приложения

source: Link to Google Play for corporate app
ru: Ссылка в Google Play для корпоративного приложения

source: Default UI theme
ru: Тема интерфейса по умолчанию

source: Minimal iOS application version required for this server. Used for breaking changes
ru: Минимальная версия приложения iOS требуемая на этом сервере. Используется для обратно несовместимых изменений

source: Minimal android application version required for this server. Used for breaking changes
ru: Минимальная версия приложения Android требуемая на этом сервере. Используется для обратно несовместимых изменений

source: Minimal iOS corp application version required for this server. Used for breaking changes
ru: Минимальная версия корпоративного приложения iOS требуемая на этом сервере. Используется для обратно несовместимых изменений

source: Minimal android corp application version required for this server. Used for breaking changes
ru: Минимальная версия корпоративного приложения Android требуемая на этом сервере. Используется для обратно несовместимых изменений

source: Free registration allowed
ru: Свободная регистрация разрешена

source: Maximum size of user's upload
ru: Максимальный размер загрузок пользователя

source: Maximum number of forwarded messages
ru: Максимальное количество пересылаемых сообщений

source: Maximum number of message uploads
ru: Максимальное количество загрузок в сообщении

source: Maximum chars for: family_name, given_name, patronymic if any
ru: Максимальное количество букв для: фамилии, имени, отчества если существует

source: Maximum chars for group chat name
ru: Максимальное количество букв для названия группового чата

source: Maximum chars for team name
ru: Максимальное количество букв в названии комманды

source: Maximum chars for role in team
ru: Максимальное количество букв в названии команды

source: Maximum chars for mood in team
ru: Максимальное количество букв в названии настроения в команде

source: Maximum chars for text message
ru: Максимальное количество букв в текстовом сообщении

source: Maximum length for contact's sections names
ru: Максимальная длинна названия проекта и секций контакта

source: Maximum length for project
ru: Максимальная длинна проекта

source: Maximum length for tags
ru: Максимальная длина тэгов

source: Maximum length for task title
ru: Максимальная длина титула задачи

source: Maximum length for ColorRule description
ru: Максимальная длина описания правила цвета

source: Maximum length for urls
ru: Максимальная длина ссылок

source: Maximum length for Integration comment
ru: Максимальная длина комментариев интеграций

source: Maximum teams for one account
ru: Максимальное количество команд для одного пользователя

source: Maximum search result
ru: Максимальное количество результатов поиска

source: Multi nodes mode (federation) enabled
ru: Режим многих узлов включен (федерация)

source: Max inactivity seconds
ru: Максимальное количество секунд не активности

source: Password authentication enabled
ru: Аутентификация по паролю включена

source: QR-code / link authentication enabled
ru: Аутентификация по QR-коду или ссылки включена

source: SMS authentication enabled
ru: SMS аутентификация включена

source: Two-factor authentication (2FA) enabled
ru: Двух факторная аутентификация включена

source: Mandatory setting of the pin code in the application
ru: Обязателен ли PIN код?

source: Max number of attempts to enter an invalid PIN code
ru: Максимальное количество неправильных вводов PIN кода

source: External services
ru: Внешние сервисы

source: ICE servers for WebRTC
ru: ICE серверы для WebRTC

source: True for premise installation
ru: True при установки на внешний сервер

source: Name of installation
ru: Название установки

source: Installation title, used on login screen
ru: Название установки. Используется на входной странице

source: Custom application icon name, if any
ru: Имя настроенной иконки если существует

source: AppBackground image url, if any
ru: Ссылка на изображение на заднем фоне приложения если существует

source: WebBackground image url, if any
ru: Ссылка на изображение на заднем фоне веб страницы если существует

source: Testing installation
ru: Установка для тестирования

source: Yandex metrika counter id
ru: Id счетчика Yandex метрики

source: Amplitude api key
ru: Amplitude ключ API

source: Minimal chars number for starting global search
ru: Минимальное количество букв чтобы начать глобальный поиск

source: Resend message in n seconds if no confirmation from server given
ru: Попробовать снова отправить сообщение если сервер не ответил в течение данного времени в секундах

source: Frontend sentry.io settings
ru: Настройки sentry.io

source: Message drafts saved on server
ru: Сохраняются ли черновики сообщений на сервере

source: Firebase settings for web-push notifications
ru: Настройки Firebase для веб пуш уведомлений

source: Calls version. 0 = disabled, 1 = audio only, 2 = audio+video
ru: Версия звонков. 0 = отключены, 1 = только аудио, 2 = аудио+видео

source: Calls functions enabled for mobile applications
ru: Звонки включены ли для мобильных приложений

source: Calls record enabled
ru: Включена ли запись звонков

source: Disallow call from multiple devices. Experimental
ru: Запретить звонок с нескольких устройств. Экспериментально

source: Maximum number of participants per call
ru: Максимальное количество участников звонка

source: Safari push id for web-push notifications
ru: Id пуш уведомлений для Safari

source: Multiple message uploads
ru: Несколько загрузок в одном приложении

source: Team entity naming. Experimental
ru: Названия для команд. Экспериментално

source: Cross team communication. Experimental
ru: Меж командная связь. Экспериментально

source: Wiki pages in chats. Experimental
ru: Вики страницы в чатах. Экспериментально

source: Default wallpaper url for mobile apps, if any
ru: Ссылка на обои по умолчанию для мобильных приложений если существует

source: Support email
ru: email поддержки

source: True if server has custom theme
ru: True если у сервера не стандартная тема

source: File Extension Whitelist
ru: Список разрешенных расширений файлов

source: File Extension Blacklist
ru: Список запрещенных расширений файлов

source: File Extension Whitelist Priority
ru: Имеют ли разрешенные расширения файлов приоритет?

source: FontColors font colors for app
ru: IconColors цвета иконок для приложения

source: Text color
ru: Цвет текста

source: Title color
ru: Цвет титула

source: Sub color
ru: Вторичный цвет

source: Brand button color
ru: Цвет кнопки бренда
