Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/data_index.po
Languages: ru

source: BgHoverColor for web
ru: Цвет наведения заднего фона для веб приложения

source: TextColor for web
ru: Цвет текста для веб приложения

source: MutedTextColor for web
ru: Цвет заглушенного текста для веб приложения

source: AccentColor for web
ru: Цвет ударения для веб приложения

source: AccentHoverColor for web
ru: Цвет наведения подчеркивания для веб приложения

source: TextOnAccentHoverColor for web
ru: Цвет наведения подчеркивания текста для веб приложения

source: MainAccent for web
ru: Цвет главный подчеркивания для веб приложения

source: MainAccentHover for web
ru: Цвет главный подчеркивания наведения для веб приложения

source: MainLightAccent for web
ru: Цвет легкий подчеркивания для веб приложения

source: MainLink for web
ru: Цвет главных ссылок для веб приложения

source: Brand color for app
ru: Цвет бренда для приложения

source: BrandDark color for app
ru: Цвет темный бренда для приложения

source: Brand light color for app
ru: Цвет светлый бренда для приложения

source: Back light color for app
ru: Цвет светлого заднего фона для приложения

source: Back dark color for app
ru: Цвет темного заднего фона для приложения

source: Success color for app
ru: Цвет успеха для приложения

source: Success light color for app
ru: Цвет успеха светлый для приложения

source: Error color for app
ru: Цвет ошибки для приложения

source: Error light color for app
ru: Цвет ошибки светлый для приложения

source: Background color for app
ru: Цвет заднего фона для приложения

source: Tab background color for app
ru: Цвет заднего фона закладок для приложения

source: Chat input background color for app
ru: Цвет заднего фона окна ввода текста сообщения для приложения

source: Substrate background color for app
ru: Цвет субстрата заднего фона для приложения

source: Modal background color for app
ru: Модульный цвет заднего фона для приложения

source: Title background color for app
ru: Цвет заднего фона титула для приложения

source: Attention color for app
ru: Цвет внимания для приложения

source: Attention light color for app
ru: Цвет внимания светлый для приложения

source: Font colors for app
ru: Цвет шрифтов для приложения

source: Message colors for app
ru: Цвет сообщений для приложений

source: Switcher colors for app
ru: Переключаемые цвета для приложения

source: Button colors for app
ru: Цвет кнопок для приложения

source: Input colors for app
ru: Цвета ввода для приложения

source: Icon colors for app
ru: Цвет иконок для приложения

source: WebBase colors for web
ru: WebBase цвета для веб

source: Total unread messages
ru: Общее количество не прочитанных сообщений

source: Total unread messages with mentions
ru: Общее количество непрочитанных сообщений с упоминаниями

source: Total chats with unread messages
ru: Общее количество чатов с непрочитанными сообщениями

source: Uploaded media
ru: Загруженные медиа

source: Upload id
ru: Id загрузки

source: Uploaded at
ru: Во-сколько загружено

source: Upload size in bytes
ru: Размер загрузки в байтах

source: Mediafile duration (for audio/video only)
ru: Длительность (только для аудио или видео)

source: Filename
ru: Имя файла

source: Preview details
ru: Детали предварительного просмотра

source: Content type
ru: Тип содержания

source: Is animated (images only)
ru: Анимировано ли? (только для изображений)

source: Compact representation of a placeholder for an image (images only)
ru: Плотное представление заменителя изображения (только для изображений)

source: File still processing (video only)
ru: Файл еще обрабатывается (только для видео)

source: PDF version of file. Experimental
ru: PDF версия файла. Экспериментально

source: ?type=file,image,audio,video
ru: Тип. Либо вилео, либо изображение, либо аудио, либо файл…

source: Upload preview
ru: Предварительный просмотр загрузки

source: Absolute url to image
ru: абсолютная ссылка на изображение

source: Absolute url to high resolution image (retina)
ru: Абсолютная ссылка на изображение высокого разрешения

source: Width in pixels
ru: Ширина в пикселях

source: Height in pixels
ru: Высота в пикселях

source: Upload + ShortMessage
ru: Загрузка + короткое сообщение

source: Upload information
ru: Информация о загрузке

source: Short message information
ru: Коротка информация о сообщении

source: Account data
ru: Данные учетной записи

source: Phone for login
ru: Телефон для входа

source: Email for login
ru: Email для входа

source: Send pushes even user is online
ru: Отправлять пуш даже если пользователь в сети

source: Show unread chats in chat list first
ru: Показывать непрочитанные чаты в списке чатов первыми

source: Show unread chats in chat list first on mobiles
ru: Показывать непрочитанные чаты в списке чатов на мобильных телефонах

source: Timezone
ru: Часовой пояс

source: Start silently time (no pushes, no sounds)
ru: Время начала тихого времени (нет будет пушей или звуков)

source: Finish silently time (no pushes, no sounds)
ru: Время окончания тихого времени

source: Account data with extra information
ru: Дополнительная информация учетной записи

source: Inviter id, if any
ru: Id того кто пригласил

source: Available teams
ru: Доступные команды

source: Registered push devices
ru: Зарегистрированные устройства для пушей

source: Chat wallpaper
ru: Wallpaper

source: Unique identifier
ru: Уникальный идентификатор

source: Localized description
ru: Локализованное описание

source: Url to jpg or png
ru: Ссылка на jpg или png

source: Query parameters for listing messages
ru: Query для списка задач
