Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/data_index.po
Languages: ru

source: Simple button color
ru: Цвет простой кнопки

source: Bubble sent color
ru: Цвет пузыря отправлений

source: Bubble received color
ru: Цвет пузыря получения

source: Group chat membership status
ru: Статус членства в групповых чатах

source: Status in group
ru: Статус в группе

source: Can I remove this member
ru: Могу ли я убрать этого пользователя

source: Interactive Connectivity Establishment Server for WEB Rtc connection. Readonly
ru: Сервер для установки соединений через NAT (Interactive Connectivity Establishment). Только для чтения

source: URls
ru: Ссылки

source: IconColors icon colors for app
ru: IconColors цвета иконок для приложения

source: Brand color
ru: Цвет бренда

source: Other color
ru: Другой цвет

source: Icon data. For icon generated from display name contains Letters + Color fields
ru: Данные иконок. Для иконок созданных из отображаемого имени состоит из букв + поля цветов

source: Small icon
ru: Маленькая иконка

source: Large image
ru: Большое изображение

source: Letters (only for stub icon)
ru: Буквы (только для иконки заглушки)

source: Icon background color (only for stub icon)
ru: Цвет заднего фона иконки (только для иконки заглушки)

source: Compact representation of a placeholder for an image (experimental)
ru: Компактное представление заменителя изображения (экспериментально)

source: InputColors input colors for app
ru: InputColors входные цвета для приложения

source: Static color
ru: Статический цвет

source: Active color
ru: Активный цвет

source: Disable color
ru: Цвет отключения

source: Error color
ru: Цвет ошибки

source: Integration for concrete chat
ru: Форма интеграции

source: Id
ru: Id чата

source: Comment, if any
ru: Комментарий если существует

source: Creation datetime, iso
ru: Дата и время создания

source: Integration enabled
ru: Включена ли интеграция

source: Integration form
ru: Форма интеграции

source: Chat id
ru: Id чата

source: Full description
ru: Полное описание

source: Unique integration name
ru: Уникальное имя интеграции

source: Integration form field
ru: Форма интеграции

source: Label
ru: Этикетка

source: Is field readonly
ru: Только ли для чтения поле?

source: Current value
ru: Текущее значение

source: Api key field, if any
ru: Ключ API если существует

source: Webhook url, if any
ru: Ссылка Webhook если существует

source: Url, if any
ru: Ссылка если существует

source: Integration unique name
ru: Уникальное имя интеграции

source: Plugin title
ru: Имя расширения

source: Integration template
ru: Шаблон интеграции

source: Path to icon
ru: Путь к иконке

source: Plugin description
ru: Описание расширения

source: Complete integrations data, as received from server
ru: Полные данные об интеграции, как получены с сервера

source: Currently existing integrations
ru: Интеграции которые существуют на текущий момент

source: Types of integrations available for setup
ru: Аккаунт из другой комманды, Active Directory или сервера

source: Account from other team, Active Directory or node
ru: Аккаунт из другой команды, Active Directory или узла

source: Account id
ru: Id аккаунта

source: Full name
ru: Полное имя

source: Icons
ru: Иконки

source: Common team uids, if any
ru: Uid общих команд

source: Session Description Protocol information
ru: Session Description Protocol информация

source: See https://rtcweb-wg.github.io/jsep/#rfc.section.4.1.8
ru: Смотрите https://rtcweb-wg.github.io/jsep/#rfc.section.4.1.8

source: Markup entity. Experimental
ru: Еденица Markup. Экспериментально

source: Open marker offset
ru: Смещение открытой пометки

source: Open marker length
ru: Длина открытой пометки

source: Close marker offset
ru: Смещение закрытой пометки

source: Close marker length
ru: Длина закрытой пометки

source: Marker type
ru: Тип пометки

source: Url, for Link type
ru: Ссылка для типа Ссылки

source: Text replacement
ru: Текст заменитель

source: Time, for Time type
ru: Время для типа Времени

source: List of internal markup entities
ru: Список внутренних markup единиц

source: Chat message
ru: Сообщение в чате

source: Message content struct
ru: содержание сообщения

source: Simple plaintext message representation
ru: Простое текстовое представление сообщения

source: Sender contact id
ru: Id отправителя

source: Recipient id (group, task or contact)
ru: Id получателя (группа, задача или контакт)

source: Message uid
ru: Uid сообщения

source: Message creation datetime (set by server side) or sending datetime in future for draft messages
ru: Дата и время создания сообщения (установленная сервером) или дата и время в отправки в будущем для черновиков

source: Creation datetime for draft messages
ru: Дата и время создания черновика

source: External/internals links
ru: Внутренние/внешние ссылки

source: Markup entities. Experimental
ru: Единицы Markup. Экспериментально

source: Importance flag
ru: Флаг важности

source: ISODateTimeString of message modification or deletion
ru: Дата и время изменения или удаления в формате ISO

source: Message was seen by anybody in chat. True or null
ru: Сообщение был увиденно кем либо. True или null

source: Unused yet
ru: Не используется еще

source: Disable link previews. True or null
ru: Отключить предварительный просмотр ссылок. True или null

source: Has link previews. True or null
ru: Имеет предварительный просмотр ссылок. True или null

source: Previous message id in this chat. Uid or null
ru: Id предыдущего сообщения в этом же чате. Uid или null

source: This message is first in this chat. True or null
ru: Это сообщение первое в этом чате. True или null

source: This message is last in this chat. True or null
ru: Это сообщение последнее в чате. True или null

source: Message uploads
ru: Загрузки в сообщении

source: Message reactions struct. Can be null
ru: Реакции сообщения

source: Message that was replied to, if any
ru: Сообщение которое было отвечено этим сообщением

source: Forwarded messages. Can be null. Also contains double of ReplyTo for backward compatibility
ru: Пересланные сообщения. Возможен null. Также содержит двойник поля ReplyTo для обратной совместимости

source: Has mention (@). True or null
ru: Есть упоминание (@). True или null

source: Message has no pushes and did not affect any counters
ru: Сообщение никого не уведомляет и не учитывается счетчиками

source: Author can change this message until date. Can be null
ru: Автор может изменить сообщение до этой даты и времени

source: Index number of this message. Starts from 0. Null for deleted messages. Changes when any previous message wad deleted
ru: Индекс этого сообщения. Начинается 0. Null для удаленных сообщений. Изменяется когда какое либо предыдущее сообщение было удалено

source: This message is archive. True or null
ru: Это сообщение за архивировано. True или null

source: Debug information, if any
ru: Отладочная информация если существует

source: MessageColors message colors for app
ru: MessageColors цвета сообщений для приложения

source: Bubble important color
ru: Цвет важного пузыря

source: Status feed color
ru: Цвет списка статуса

source: Status bubble color
ru: Цвет пузыря статуса

source: Allocated color
ru: выделенный цвет

source: Chat message content
ru: Содержание сообщения чата

source: Text representation of message
ru: Текстовое представление чата

source: Message type
ru: Тип сообщения

source: Message subtype, if any
ru: Подтип сообщения если существует

source: Upload id, if any. Deprecated: use Uploads instead
ru: Id загрузок если существуют. Устарело: используйте Uploads вместо этого

source: Upload url, if any. Deprecated: use Uploads instead
ru: Ссылка на загрузку если существует. Устарело: используйте Uploads вместо этого

source: Upload size, if any. Deprecated: use Uploads instead
ru: Размер загрузки. Устарело: используйте Uploads вместо этого

source: Upload duration, if any. Deprecated: use Uploads instead
ru: Длительность. Устарело: используйте Uploads вместо этого

source: Upload still processing, if any. Deprecated: use Uploads instead
ru: Загрузка все еще обрабатывается если существует. Устарело: используйте Uploads вместо этого

source: Compact representation of a placeholder for an image. Deprecated: use Uploads instead
ru: Компактное представление заменителя изображения. Устарело: используйте Uploads вместо этого

source: Upload preview height, in pixels, if any. Deprecated: use Uploads instead
ru: Высота предварительного просмотра загрузки в пикселях. Устарело: используйте Uploads вместо этого

source: Upload width, in pixels, if any. Deprecated: use Uploads instead
ru: Ширина предварительного просмотра загрузки в пикселях. Устарело: используйте Uploads вместо этого

source: Upload preview absolute url, if any. Deprecated: use Uploads instead
ru: Абсолютная ссылка на предварительный просмотр загрузки. Устарело: используйте Uploads вместо этого

source: Upload high resolution preview absolute url, if any. Deprecated: use Uploads instead
ru: Абсолютная ссылка на предварительный просмотр загрузки в высоком разрешении. Устарело: используйте Uploads вместо этого

source: Upload name, if any. Deprecated: use Uploads instead
ru: Имя загрузки если существует. Устарело: используйте Uploads вместо этого

source: Upload is animated image, if any. Deprecated: use Uploads instead
ru: Загрузка является анимированным изображением. Устарело: используйте Uploads вместо этого

source: Change title (for "change" mediatype)
ru: Титул изменений (для медиа типа «change»)

source: Change old value (for "change" mediatype)
ru: Старое значение (для медиа типа «change»)

source: Change new value (for "change" mediatype)
ru: Новое значение (для медиа типа «change»)

source: Change actor contact id (for "change" mediatype)
ru: Id исполнителя изменений (для медиа типа «change»)

source: Comment (for "audiomsg" mediatype)
ru: Комментарий (для медиа типа «audiomsg»)

source: Given name (for "contact" mediatype)
ru: Имя личное (для медиа типа «contact»)

source: Family name (for "contact" mediatype)
ru: Фамилия (для медиа типа «contact»)

source: Patronymic name (for "contact" mediatype)
ru: Отчество (для медиа типа «contact»)

source: Contact phones list (for "contact" mediatype)
ru: Список номеров телефонов контакта (для медиа типа «contact»)

source: Emails list (for "contact" mediatype)
ru: Список email (для медиа типа «contact»)

source: Stickerpack name (for "sticker" subtype)
ru: Название упаковки стикеров (для медиа типа «sticker»)

source: Pdf version, if any
ru: PDF версия если существует

source: Checked message links. In short: "Click here: {link.Pattern}" => "Click here: <a href='{link.Url}'>{link.Text}</a>"
ru: Провереные ссылки в сообщениях. То есть: «Click here: {link.Pattern}» => «Click here: <a href=“{link.Url}“>{link.Text}</a>»

source: Text fragment that should be replaced by link
ru: Фрагмент текста который должен быть замене ссылкой

source: Internal or external link
ru: Внутренняя или внешняя ссылка

source: Optional preview info, for websites
ru: Необязательная информация пред просмотра для веб сайтов

source: Optional upload info
ru: Необязательная информация о загрузках

source: Website previews disabled
ru: Предварительный просмотр сайтов отключен

source: Optional youtube movie id
ru: Необязательный Id ролика youtube

source: Website title and description
ru: Титул веб сайта и описание

source: Website title or og:title content
ru: Титул веб сайта или og:title содержание

source: Website description
ru: Описание веб сайта

source: Message emoji reaction
ru: MessageReaction

source: Number of reactions
ru: Количество реакций

source: Details
ru: Детали

source: When reaction added, iso datetime
ru: Когда реакция была добавлена в iso дате и времени

source: Reaction author
ru: Автор реакции

source: Reaction emoji
ru: Эмоджи реакции

source: Reactions to messages: frequently used and all available
ru: Реакции к сообщениям: часто используемые и все доступные

source: My frequently used reactions
ru: Мои часто используемые реакции

source: All available reactions
ru: Все доступные реакции

source: Node (for external users)
ru: Узел (для внешних пользователей)

source: Node uid
ru: uid узла

source: Node title
ru: Титул узла

source: Synchronization with node works
ru: Синхронизация с узлом работает

source: Integration title
ru: Титул интеграции

source: Redirect url
ru: Ссылка перенаправления

source: Active call status
ru: Статус активного звонка

source: Chat or contact id
ru: Id чата или контакта

source: Call id
ru: Id звонка

source: Call start
ru: Начало звонка

source: Number participants in call
ru: Количество участников звонка

source: Contact online status
ru: Онлайн статус контакта

source: Is away from keyboard
ru: Не у клавиатуры

source: Focus mode enabled
ru: Режим фокуса включен

source: Is mobile client
ru: Мобильный клиент?

source: PDF preview of mediafile. Experimental
ru: PDF предварительный просмотр медиа файла. Экспериментально

source: Absolute url
ru: Абсолютная ссылка

source: First string of text content
ru: Первая строка теста

source: Push device info
ru: Информация о пуш устройстве

source: Type: android, ios, web, safari
ru: Тип: android, ios, web, safari

source: Device id generated by client library
ru: Id устройства созданное клиентской библиотекой

source: Notification token
ru: Токен уведомлений

source: Notification token for VOIP (iOS only)
ru: Токен уведомлений для VOIP (только iOS)

source: Readable device name
ru: Читаемое название устройства

source: Send silently data pushes that must be fully processed by app. Must be true for modern mobile clients
ru: Посылать тихо данные которые должны быть обработаны клиентом. Должно быть true для всех современных мобильных клиентов

source: Send badge value as data. Experimental
ru: Посылать значки как данные. Экспериментально

source: deprecated
ru: Устарело

source: Emoji reaction
ru: Эмоджи реакция

source: Message receiving status
ru: Статус получения сообщения

source: Message id
ru: Id сообщения

source: Is received
ru: Получено ли?

source: Number of contacts received this message. Experimental
ru: Количество контактов которые получили это сообщение. Экспериментально

source: Debug message, if any
ru: Отладочное сообщение если существует

source: Activation time, iso
ru: Время активации в iso дате и времени

source: Server response
ru: Ответ сервера

source: Server side work time
ru: Время затраченное сервером.

source: Request status
ru: Статус запроса

source: Result only if ok is true)
ru: Результат. (только если ``ok`` равно ``true``)

source: Error (only if ok is false)
ru: Ошибка. (только если ``ok`` равно ``false``)

source: Error (only if ok is false and Error is 'InvalidData')
ru: Ошибка. (только если ``ok`` равно ``false`` и ``Error`` является ``'InvalidData'``)

source: Reason (only if ok is false and Error is `AccessDenied`)
ru: Причина. (только если ``ok`` равно ``false`` и ``Error`` является ``'AccessDenied'``)

source: Reason markup (only if ok is false and Error is `AccessDenied`)
ru: Markup причины. (только если ``ok`` равно ``false`` и ``Error`` является ``'AccessDenied'``)

source: Task project or contact section
ru: Задача проекта или секция контакта

source: Sort ordering
ru: Порядок сортирования

source: Name
ru: Имя

source: Description, if any
ru: Описание

source: Is deleted
ru: Было удалено

source: Websocket session
ru: Websocket сессия

source: Session id
ru: Id сессии

source: Creation datetime
ru: Дата и время создания

source: Language code
ru: Код языка

source: Mobile
ru: Мобильный?

source: Away from keyboard
ru: Не у клавиатуры

source: IP address
ru: IP адрес

source: #-link autocomplete information
ru: Авто заполнение имен чатов

source: Icon data, if any
ru: Дата иконок если существует

source: Internal details
ru: Внутренние детали

source: #-link autocomplete details
ru: Детали авто заполнения чатов

source: Is task or group public for non-guests
ru: Задача или группа доступна гостям

source: Task status (for tasks)
ru: Статус задачи

source: Task number (for tasks)
ru: Номер задачи

source: Deprecated: use `TaskStatus == "done"` comparsion
ru: Устарело: используйте ``TaskStatus == "done"``

source: Short message based on chat message
ru: Короткое сообщение основанное на сообщении чата

source: Small or large icon
ru: Большая или маленькая иконка

source: absolute url to icon
ru: абсолютная ссылка на иконку

source: Icon width, in pixels
ru: Ширина иконки в пикселях

source: Icon height, in pixels
ru: Высота иконки в пикселях

source: Subscription
ru: Подписка

source: Subscription - an entity that signifies the fact of subscribing to the tariff of any team for a certain period (not defined, in the case of the default tariff)
ru: Подписка - сущность которая подразумевает факт подписки на тариф любой команды на какой то период (если отсутствует то стандартный тарриф)

source: Subscription id
ru: ID подписки

source: Subscription activation time
ru: Время активации подписки

source: Subscription expiration time
ru: Время истекания подписки

source: ID of the tariff for which the subscription is valid
ru: ID таррифа для которого подписка является действительной

source: ID of the user who subscribed
ru: ID пользователя который подписан

source: Link to sub/sup task
ru: Ссылка на под задачу

source: Task id
ru: Id задачи

source: Subtask task status
ru: Статус подзадачи

source: SwitcherColors switcher colors for app
ru: SwitcherColors переключатель цветов в приложении

source: On color
ru: Цвет включения

source: Off color
ru: Цвет выключения

source: Task tag
ru: Тэг задачи

source: Tag name
ru: Имя тэга

source: Tariff for teams
ru: Тариф для комманд

source: Tariff id
ru: Id тарифа

source: Title of tariff in enlish
ru: Титул тарифа на английском

source: Title of tariff in russian
ru: Титул тарифа на русском

source: Price of tariff
ru: Стоимость тарифа

source: Cloud space reserved for storing team users uploads in megabytes
ru: Объем зарезервированного места в облаке для загрузок в мегабайтах

source: Maximum allowed number of members in a team
ru: Максимальное количество участников в команде

source: maximum file size for uploading
ru: Максимальный размер загрузки

source: Custom task color
ru: Настраиваемый цвет задачи

source: Task description
ru: Описание задачи

source: Task tags
ru: Список тэгов задачи

source: Task section UID
ru: Id проекта / секции

source: User who follow the task
ru: Id подписчиков

source: Items of the task
ru: Предметы задачи

source: User who was assigned the task
ru: Пользователь которому была дана задача

source: Deadline time, if any
ru: Дедлайн задачи

source: Fire a reminder at this time
ru: Послать уведомление в данное время

source: Task importance
ru: Важность задачи

source: Task urgency
ru: Срочность задачи

source: Task complexity
ru: Сложность задачи

source: Time spent
ru: Время затраченное на задачу

source: Linked messages
ru: Присоединенные сообщения

source: Task uploads
ru: Загрузки задачи

source: Task color rules color
ru: Правило цветов задач

source: Regular color
ru: Обычный цвет

source: Dark color
ru: Темный цвет

source: Light color
ru: Светлый цвет

source: Tasks counters
ru: TaskCounters

source: Task jid
ru: jid задачи

source: Unreads counter
ru: Счетчик непрочитанных

source: Task filter
ru: Фильтр задач

source: Task filter field
ru: Поле фильтра задач

source: Filter title
ru: Титул фильтра

source: Task checklist item
ru: Предмет чеклиста задачи

source: Text or "#{OtherTaskNumber}"
ru: Текст или ``«#{OtherTaskNumber}»``

source: Item checked
ru: Отмечено выполнимым

source: Can I toggle this item
ru: Могу ли я отметить этот предмет

source: Can I change this item
ru: Могу ли я поменять этот предмет

source: Link to subtask. Optional
ru: Ссылка на подзадачу

source: Task sort type
ru: Тип сортировки задачи

source: Field
ru: Поле

source: Sort title
ru: Титул сортировки

source: Custom task status
ru: Настраиваемый статус задачи

source: Status id
ru: Id статуса

source: Status sort ordering
ru: Порядок сортирования статуса

source: Status internal name
ru: Внутреннее имя статуса

source: Status localized name
ru: Локализованное имя статуса

source: Status not used anymore
ru: Статус больше не используется

source: Task tab
ru: Вкладка задачи

source: Tab name
ru: Имя вкладки

source: Tab title
ru: Титул вкладки

source: Disable this tab when it has no contents
ru: Отключить ли вкладку если нет содержания

source: Show unread badge
ru: Показывать значок непрочитанных

source: Enable pagination
ru: Включить страницы

source: Filters inside tab
ru: Фильтры внутри вкладки

source: Sort available in tab
ru: Сортировка доступна в вкладке

source: Unread tasks with jid and counters
ru: Jid непрочитанных задач и счетчики

source: Team name
ru: Название команды

source: Default task deadline
ru: Дедлайн задач по умолчанию

source: Max message update/deletion age, in seconds
ru: Максимальное время обновления или удаления сообщений в секундах

source: Team icons
ru: Иконки команды

source: User last activity was in this team
ru: Последняя активность пользователя была в этой команде

source: What status I can set to other team members
ru: Какие статусы я могу задавать другим участникам команды

source: My profile in this team isn't full
ru: Мой профиль в этой команде не полноценный

source: Need confirmation after invite to this team
ru: Нужно подтверждение после приглашения в эту команду

source: Patronymic in usernames for this team
ru: Использовать отчество в именах пользователей этой команды

source: Username fields ordering. Possible values: "family_name", "given_name", "patronymic"
ru: Порядок отображения имен пользователей. Возможные значения: "family_name", "given_name", "patronymic"

source: Family name should be first in display name
ru: Фамилия должна быть первой в отображаемом имени

source: Use importance field in task
ru: Использовать поле значимости в задачах

source: Minimal value of task importance. Default is 1
ru: Минимальное значение важности. По умолчанию 1

source: Maximum value of task importance. Default is 5
ru: Максимальное значение важности задач. По умолчанию 5

source: Bigger number = bigger importance. Default: lower number = bigger importance
ru: Большая величина значит важнее. По умолчанию: меньшая величина значить важнее

source: Use urgency field in task
ru: Использовать поле срочности в задачах

source: Use complexity field in task
ru: Использовать поле сложности в задачах

source: Use spent time field in task
ru: Использовать затраченное время в задачах

source: Total uploads size, bytes
ru: Всеобщий размер загрузок в байтах

source: Maximum uploads size, bytes, if any
ru: Максимальный размер загрузок в байтах если существует

source: Unread message counters
ru: Счетчики непрочитанных сообщений

source: My profile in this team
ru: Мой профиль в этой комманде

source: Team contacts. Used only for team creation
ru: Контакты команды. Только используется при создании комманды

source: For single group teams, jid of chat
ru: Для команд с одной группой jid чата

source: Color theme, if any
ru: Цветовая тема если существует

source: Don't show archived users by default
ru: Не показывать архивированных пользователей по умолчанию

source: Team pinned
ru: Закреплена ли команда

source: Team's available tariff by includig archive ones
ru: Доступные тарифы команды включая архивированные

source: Сurrent team subscription
ru: Текущая подписка комманды

source: Short team representation. For invites, push notifications, etc. Readonly
ru: Сокращенное представление команды. Для приглашений, пуш уведомлений, и так далее. Только для чтения

source: Experimental translation fields for "team" entity renaming. Readonly
ru: Экспериментальная локализация команд. Только для чтения

source: Color theme
ru: Цветовая тема

source: BgColor for web
ru: Цвет заднего фона для веб приложения
