Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/events.po
Languages: ru

source: Client events
ru: События клиента

source: Change AFK (away from keyboard) status
ru: Поменять AFK (не у клавиатуры) статус

source: ``afk`` - Is away from keyboard
ru: ``afk`` - Не у клавиатуры

source: Call buzzing cancelled
ru: Отмена звонка

source: ``jid`` - Chat or contact id
ru: ``jid`` - id чата или контакта

source: Leave call
ru: Покинуть звонок

source: ``reason`` - Reason, if any
ru: ``reason`` - Причина если есть

source: Mute all other call participants
ru: Заглушить всех других участников звонка

source: **MISSING EXAMPLE**
ru: **ПРИМЕР ОТСУТСТВУЕТ**

source: Start a call
ru: Начать звонок

source: ``muted`` - Mute state
ru: ``muted`` - состояние безмолвности

source: ``sdp`` - SDP (session description protocol) data
ru: ``sdp`` - SDP (session description protocol) данные

source: ``trickle`` - Is trickle mode enabled
ru: ``trickle`` - струйный режим включен

source: Reject the call
ru: Отвергнуть звонок

source: For exchange Session Description with server when client's Local Session Description is changed
ru: Для обмена Session Description с сервером когда Local Session Description клиента был изменен

source: ``jsep`` - SDP data
ru: ``jsep`` - SDP данные

source: ``uid`` - Call id
ru: ``uid`` - Id звонка

source: Change mute state in call
ru: Поменять состояние безмолвности

source: Send trickle candidate for webrtc connection
ru: Послать trickle кандидата для webrtc соединения

source: ``candidate`` - Trickle candidate
ru: ``candidate`` - Trickle кандидат

source: ``sdp_mline_index`` - SDP index
ru: ``sdp_mline_index`` - SDP индекс

source: Typing or recording audiomessage
ru: Пишет или записывает аудио сообщение

source: ``composing`` - true = start typing / audio recording, false = stop
ru: ``composing`` - true = начать писать / записывать аудио, false = остановиться

source: ``draft`` - Message draft data
ru: ``draft`` - Данные черновика сообщения

source: ``is_audio`` - true = audiomessage, false = text typing
ru: ``is_audio`` - true = аудио сообщение, false = набор текста

source: Last read message in chat changed
ru: Последние прочитанное сообщение в чате изменилось

source: ``last_read_message_id`` - Last read message id. Omitted = last message in chat
ru: ``last_read_message_id`` - Id последнего прочитанного сообщения. Если нет то последние сообщение в чате

source: Client confirmed server message
ru: Клиент подтвердил сообщение с сервера

source: ``confirm_id`` - Unique identifier generated by client
ru: ``confirm_id`` - Уникальный идентификатор созданный клиентом.

source: Message deleted
ru: Сообщение удалено

source: ``message_id`` - Message id
ru: ``message_id`` - Id сообщения

source: Message created or changed
ru: Сообщение создано или изменено

source: ``comment`` - Deprecated
ru: ``comment`` - Устарело

source: ``content`` - Message content. Required
ru: ``content`` - содержание сообщения. Обязательно

source: ``important`` - Important flag. Not required. Default: false
ru: ``important`` - флаг важности. Не обязательно. По умолчанию: false

source: ``linked_messages`` - Forwarded messages (previously was for reply too). Not required
ru: ``linked_messages`` - Пересланные сообщения (ранее тоже были для ответа). Не требуется

source: ``message_id`` - Uid created by client. Recommended
ru: ``message_id`` - Uid созданное клиентом. Рекомендуется

source: ``nopreview`` - Disable links preview generation. Not required. Default: false
ru: ``nopreview`` - Отключить создание предварительного просмотра ссылок. Не требуется. По умолчанию: false

source: ``old_style_attachment`` - Backward compatibility mode
ru: ``old_style_attachment`` - Режим обратной совместимости

source: ``reply_to`` - Replied to message id. Not required
ru: ``reply_to`` - Ответил на сообщение на заданном Id. Не требуется

source: ``to`` - Chat, task or contact jid. Required
ru: ``to`` - JID чата, задачи или контакта. Требуется

source: ``uploads`` - Message attachments
ru: ``uploads`` - Прикрепления сообщения

source: Empty message for checking server connection
ru: Пустое сообщение чтобы проверить статус соединения

source: Server events
ru: События сервера

source: Call parameters (deprecated: use `ServerCallSdp`)
ru: Параметры звонка (устарело: используйте `ServerCallSdp`)

source: ``candidates`` - List of ICE candidates (when trickle = false)
ru: ``candidates`` - Список ICE кандидатов (когда trickle = false)

source: ``onliners`` - Current call participants
ru: ``onliners`` - Текушие участники звонка

source: Call buzzing
ru: Звонок гудит

source: ``actor`` - Short call creator information
ru: ``actor`` - Краткая информация о создателе звонка

source: ``buzz_timeout`` - Number of seconds for stop buzzing
ru: ``buzz_timeout`` - Количество секунд до окончания звонка

source: ``chat`` - Short chat information
ru: ``chat`` - Краткая информация о чате

source: ``display_name`` - Chat title
ru: ``display_name`` - Титул чата

source: ``icons`` - Chat icons
ru: ``icons`` - Иконки чата

source: ``team`` - Deprecated
ru: ``team`` - Устарело

source: ``teaminfo`` - Short team information
ru: ``teaminfo`` - Краткая информация о команде

source: Call cancelled on buzzing
ru: Звонок отменен на гудке

source: ``team`` - Team id
ru: ``team`` - Id команды

source: Experimental function
ru: Экспериментальная функция

source: ``fingerprint`` - DOCUMENTATION MISSING
ru: ``fingerprint`` - Отсутствует документация

source: Participant leave a call
ru: Участник звонка покинул звонок

source: ``uid`` - Call uid
ru: ``uid`` - uid звонка

source: All participants in call muted
ru: Все участники звонка заглушены

source: Call rejected
ru: Отвергнуть звонок

source: Call restarted
ru: Звонок перезапущен

source: For exchange Session Description with client when server's Local Session Description is changed
ru: Для обмена Session Description с клиентом когда Local Session Description сервера был изменен

source: Mute/unmute call participant
ru: Отключить / включить микрофон участника звонка

source: Call information
ru: Информация о звонке

source: ``audiorecord`` - Call record enabled
ru: ``audiorecord`` - Запись звонка включена

source: ``buzz`` - Call buzzing
ru: ``buzz`` - Звонок гудит

source: ``created`` - Creation date, iso datetime
ru: ``created`` - время создания в формате iso

source: ``finish`` - Call finish
ru: ``finish`` - Звонок окончен

source: ``gentime`` - Version
ru: ``gentime`` - Версия

source: ``onliners`` - Call participants
ru: ``onliners`` - Участники звонка

source: ``start`` - Call start. For direct calls can be empty when buzzing
ru: ``start`` - Начало звонка. Для прямых звонков может быть пустым во время гудка

source: ``timestamp`` - Deprecated: use gentime or created
ru: ``timestamp`` - Устарело: используйте поля ``gentime`` или ``created``

source: Someone talks in call
ru: Кото-то говорит в звонке

source: ``actor`` - Actor id
ru: ``actor`` - Id исполнителя

source: ``talking`` - Is talking
ru: ``talking`` - говорит сейчас?

source: Someone typing or recording audiomessage in chat
ru: Кто-то пишет или записывает звонок в чате

source: ``valid_until`` - Composing event max lifetime
ru: ``valid_until`` - Максимальная длительность жизни

source: Chat deleted
ru: Чат удален

source: ``badge`` - Total number of unreads
ru: ``badge`` - количество непрочитанных сообщений

source: ``chats`` - List of deleted chats
ru: ``chats`` - список удаленных чатов

source: ``team_unread`` - Current team counters
ru: ``team_unread`` - количество непрочитанных в этой команде

source: Changed draft message in chat
ru: Черновик сообщения был изменен

source: ``draft`` - Draft text
ru: ``draft`` - Текст черновика

source: ``draft_gentime`` - Draft version
ru: ``draft_gentime`` - Версия черновика

source: ``draft_num`` - Deprecated
ru: ``draft_num`` - Устарело

source: Changed last read message in chat
ru: Изменение последнего прочитанного сообщения

source: ``chats`` - Chat counters
ru: ``chats`` - Счетчик чата

source: Chat created or updated
ru: Чат создан или обновлен

source: Server confirmed client message
ru: Сервер потвердил сообщение клиента

source: ``confirm_id`` - Unique id generated by server
ru: ``confirm_id`` - UID созданное сервером

source: Contact created or updated
ru: Контакт создан или обновлен

source: ``contacts`` - Contact info
ru: ``contacts`` - информация контакта

source: Debug message
ru: Отладочное сообщение

source: ``text`` - Debug message
ru: ``text`` - Отладочное сообщение

source: Login from other device
ru: Логин с другого устройства

source: ``device_name`` - Device name
ru: ``device_name`` - имя устройства

source: Push replacement for desktop application
ru: Проталкивание сообщения для настольного клиента

source: ``chat`` - Chat id
ru: ``chat`` - Id чата

source: ``click_action`` - Url opened on click
ru: ``click_action`` - ссылка открываемая на нажатии

source: ``created`` - Message creation iso datetime
ru: ``created`` - время создания сообщения

source: ``icon_url`` - Absolute url to push icon
ru: ``icon_url`` - абсолютная ссылка на иконку

source: ``message`` - Push body
ru: ``message`` - тело сообщения push

source: ``sender`` - Sender contact id
ru: ``sender`` - Id контакта отправителя

source: ``subtitle`` - Push subtitle
ru: ``subtitle`` - субтитры push

source: ``tag`` - Push tag (for join pushes)
ru: ``tag`` - тэг (для объединенных push)

source: ``team`` - Team uid
ru: ``team`` - uid команды

source: ``title`` - Push title
ru: ``title`` - титул push

source: Message received by someone in chat
ru: Сообщение полученное кем-то в чате

source: ``messages`` - received message data
ru: ``messages`` - данные полученных сообщений

source: Chat message created, updated or deleted
ru: Сообщение было создано, изменено или удалено

source: ``badge`` - Total number of unreads, if changed
ru: ``badge`` - общее количество непрочитанных, если изменено

source: ``chat_counters`` - Chat counters
ru: ``chat_counters`` - счетчик чата

source: ``delayed`` - true = silently message update, false = new message
ru: ``delayed`` - true = бесшумное обновление сообщения, false = новое сообщение

source: ``messages`` - Messages data
ru: ``messages`` - данные сообщений

source: Online team members and current active calls
ru: Текшие активные звонки и члены команд онлайн

source: ``calls`` - Active calls
ru: ``calls`` - звонки в прогрессе

source: ``contacts`` - Online team members
ru: ``contacts`` - члены команд онлайн

source: Status of background operation
ru: Состояние операции на заднем фоне

source: ``action`` - Action name
ru: ``action`` - Имя действия

source: ``has_error`` - Has error
ru: ``has_error`` - Есть ли ошибка

source: ``message`` - Message
ru: ``message`` - сообщение

source: ``num`` - Current processing item
ru: ``num`` - количество текуще обрабатываемых предметов

source: Task or group remind deleted
ru: Напоминание было удалено

source: ``reminds`` - Remind information
ru: ``reminds`` - данные напоминания

source: Task or group remind fired
ru: Напоминание сработало

source: Task/group remind created or changed
ru: Напоминание обновлено

source: Contact section or task project deleted
ru: Секция контактов или задача была удалена

source: ``chat_type`` - Chat type
ru: ``chat_type`` - Тип чата

source: ``gentime`` - Deprecated
ru: ``gentime`` - Устаревшее поле

source: ``sections`` - Section/project info
ru: ``sections`` - информация о проекте или секции

source: Contact section or task project created or changed
ru: Секция контактов или задача была создана или удалена

source: ``gentime`` - deprecated
ru: ``gentime`` - Устаревшее поле

source: Tag deleted
ru: Тэг удален

source: ``tags`` - Tags info
ru: ``tags`` - информация о тэге

source: Tag created or changed
ru: Тэг создан или удален

source: Counters form other teams
ru: Счетчик других комманд

source: ``teams`` - Counters
ru: ``teams`` - счетчики

source: Team archived
ru: Комманда архивирована

source: ``teams`` - Teams info
ru: ``teams`` - информация комманд

source: Team created or changed
ru: Комманда создана или изменена

source: ``teams`` - DOCUMENTATION MISSING
ru: ``teams`` - отсутствует документация

source: Current server time
ru: Текущее время на сервере

source: ``time`` - Current time
ru: ``time`` - текущее время

source: Part of UI settings changed
ru: Часть настроик интерфейса была изменена

source: ``data`` - UiSettingsData
ru: ``data`` - Настройки пользовательского интерфейса

source: ``namespace`` - Namespace. For example: web, app
ru: ``namespace`` - Сфера. Например: web, app

source: Upload object created or changed
ru: Загрузочный объект создан или изменен

source: ``uploads`` - Uploads data
ru: ``uploads`` - данные загрузки

source: Something went wrong with client message
ru: Что-то пошло не так с сообщением клиента

source: ``orig`` - Debug information
ru: ``orig`` - отладочная информация
