Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/group_paths.po
Languages: ru

source: Group related paths.
ru: Пути относящиеся к группам

source: Get all groups in the team.
ru: Получить все группы в чате.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__groups>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__groups>`__

source: Parameters
ru: Параметры

source: ID of the team.
ru: ID команды.

source: Response JSON Object
ru: Ответный JSON объект

source: True if no error occured.
ru: True если не было ошибки

source: List of :ref:`tdproto-Chat` objects.
ru: Список :ref:`tdproto-Chat` объектов.

source: Status Codes
ru: Код статуса

source: No error.
ru: Без ошибки

source: Delete the group.
ru: Удалить группу.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__groups>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__groups>`__

source: Get the list of group members.
ru: Получить список участников группы.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__groups__group_id__members>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__groups__group_id__members>`__

source: ID of the group.
ru: ID группы.

source: List of :ref:`tdproto-GroupMembership` objects.
ru: Список :ref:`tdproto-GroupMembership` объектов.

source: Remove member from the group.
ru: Убрать участника из группы.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__groups__group_id__members__contact_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__groups__group_id__members__contact_id_>`__

source: ID of the contact.
ru: ID контакта.

source: The :ref:`tdproto-GroupMembership` object.
ru: :ref:`tdproto-GroupMembership` объект.
