Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/misc_paths.po
Languages: ru

source: Miscelaneos paths
ru: Остальные пути

source: Returns client address for debuging purposes.
ru: Возвращает адрес клиента для отладки.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_addr>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_addr>`__

source: **Example**:
ru: **Пример ответа:**

source: Response JSON Object
ru: Ответный JSON объект

source: True if no error occured.
ru: True если не было ошибки

source: Set to ``"pong"``.
ru: Задано на "pong"

source: Status Codes
ru: Код статуса

source: No error
ru: Без ошибки

source: Get list of timezones.
ru: Получить список часовых поясов.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_alltimezones>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_alltimezones>`__

source: Get list of country phone codes.
ru: Получить список государственных телефонных кодов.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_countries>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_countries>`__

source: Get the emoji list.
ru: Получить список эмоджи.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_emoji>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_emoji>`__

source: Join the team.
ru: Присоединиться к команде.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_join__token_>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_join__token_>`__

source: Parameters
ru: Параметры

source: Invite token to join team.
ru: Токен присоединения к команде

source: :ref:`tdproto-team` object.
ru: :ref:`tdproto-team` объект.

source: Invitation information.
ru: Информация приглашения.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_join__token__preview>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_join__token__preview>`__

source: Invite token to preview.
ru: Токен предварительного просмотра.

source: Invite information.
ru: Информация приглашения.

source: Ping the server.
ru: Пинг запрос на сервер

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_ping>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_ping>`__

source: **Example response**:
ru: **Пример ответа**

source: Get the list of available reactions.
ru: Получить список доступных реакций.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_reactions>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_reactions>`__

source: Get server time.
ru: Получить время на сервере.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_time>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_time>`__

source: Get the server information.
ru: Получить информацию о сервере.

source: `Try it! <https://tada-team.github.io/td-swagger-ui/#/default/getfeatures_json>`__
ru: `Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/getfeatures_json>`__

source: :ref:`tdproto-Features` object.
ru: :ref:`tdproto-Features` объект.
