Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/task_paths.po
Languages: ru

source: Task related paths
ru: Пути относящиеся к задачам

source: Get the list of tasks
ru: Получить список задач

source: Query parameters: :ref:`tdproto-TaskFilterQuery`
ru: Query параметры: :ref:`tdproto-TaskFilterQuery`

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__tasks>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__tasks>`__

source: Parameters
ru: Параметры

source: ID of the team.
ru: ID команды.

source: Response JSON Object
ru: Ответный JSON объект

source: True if no error occured.
ru: True если не было ошибки

source: List of :tdproto:ref:`Task` objects.
ru: Список :tdproto:ref:`Task` объектов.

source: Status Codes
ru: Код статуса

source: No error.
ru: Без ошибки

source: Create new task
ru: Создать новую задачу.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__tasks>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__tasks>`__

source: Request JSON Object
ru: JSON объект запроса.

source: The :tdproto:tdmodels:`Task` object.
ru: :tdproto:ref:`Task` объект.

source: The :tdproto:ref:`Task` object.
ru: :tdproto:ref:`Task` объект.

source: Get task
ru: Получить задачу

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__tasks__task_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__tasks__task_id_>`__

source: ID of the task.
ru: ID задачи.

source: Update task
ru: Изменить задачу

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__tasks__task_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__tasks__task_id_>`__

source: Delete task
ru: Удалить задачу

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__tasks__task_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__tasks__task_id_>`__
