Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/team_paths.po
Languages: ru

source: Team related paths
ru: Пути относящиеся к командам

source: Get the list of teams on the server.
ru: Получить список команд на сервере.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams>`__

source: Response JSON Object
ru: JSON объект запроса

source: True if no error occured.
ru: True если не было ошибки

source: List of :tdproto:ref:`Team` objects.
ru: Список :tdproto:ref:`Team` объектов.

source: Status Codes
ru: Код статуса

source: No error.
ru: Без ошибки

source: Get team info.
ru: Получить информацию команды.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id_>`__

source: Parameters
ru: Параметры

source: ID of the team.
ru: ID команды.

source: The :tdproto:ref:`Team` object.
ru: :tdproto:ref:`Team` объект.

source: Update team settings.
ru: Изменить настройки команды.

source: Must have admin rights.
ru: Должны быть права администратора.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/put_api_v4_teams__team_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/put_api_v4_teams__team_id_>`__

source: Request JSON Object
ru: JSON объект запроса

source: :tdproto:ref:`Team` object with updated fields.
ru: Обновленный :tdproto:ref:`Team` объект.

source: Updated :tdproto:ref:`Team` object of the team.
ru: Обновленный :tdproto:ref:`Team` обект команды.

source: Delete the team.
ru: Удалить команду.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id_>`__

source: :tdproto:ref:`Team` object of deleted team.
ru: :tdproto:ref:`Team` объект удаленной команды.

source: Get the list of chats in the team.
ru: Получить список чатов в команде.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__chats>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__chats>`__

source: List of :tdproto:ref:`Chat` objects.
ru: Список :tdproto:ref:`Chat` объектов.

source: Get the list of contacts of the team.
ru: Получить список контактов в команде.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__contacts>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__contacts>`__

source: List of :tdproto:ref:`Contact` objects.
ru: Список :tdproto:ref:`Contact` объектов.

source: Get contact details.
ru: Получить информацию о контакте.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__contacts__contact_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/get_api_v4_teams__team_id__contacts__contact_id_>`__

source: ID of the contact.
ru: ID контакта.

source: The :tdproto:ref:`Contact` object.
ru: :tdproto:ref:`Contact` объект.

source: Update contact details.
ru: Изменить детали контакта.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__contacts__contact_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/post_api_v4_teams__team_id__contacts__contact_id_>`__

source: The :tdproto:tdmodels:`Contact` object.
ru: :tdproto:ref:`Contact` объект.

source: Updated :tdproto:ref:`Contact` object.
ru: Обновленый :tdproto:ref:`Contact` объект.

source: Remove contact from the team.
ru: Удалить контакт из команды.

source: `🔍 Try it! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__contacts__contact_id_>`__
ru: `🔍 Попробуйте! <https://tada-team.github.io/td-swagger-ui/#/default/delete_api_v4_teams__team_id__contacts__contact_id_>`__

source: Removed :tdproto:ref:`Contact` object.
ru: Удаленный :tdproto:ref:`Contact` объект.
