Repository: tada-team/tdproto-sphinx
Catalog: docs/locale/*/LC_MESSAGES/websocket.po
Languages: ru

source: Websockets documentation
ru: Документация Websocket

source: Websocket is a full-duplex communication protocol. See `Wikipedia page <https://en.wikipedia.org/wiki/WebSocket>`__ for more information about Websockets.
ru: Websocket - это полно-дуплексный протокол связи. `Страница в Википедии <https://ru.wikipedia.org/wiki/WebSocket>`__ об этом протоколе.

source: In tada.team websockets are used to notify clients about events and voice calls.
ru: В tada.team websockets используются для уведомления клиентов о событиях и голосовых вызовах.

source: Connecting to websocket
ru: Подключение к websocket

source: The URL to connect to websocket has the form of ``wss://web.tada.team/messaging/{team_id}`` where team_id is the team JID to create websocket for. This means each team has to have a separated websocket connection if you want to receive events from multiple teams.
ru: Ссылка чтобы присоединиться к websocket имеет форму ``wss://web.tada.team/messaging/{team_id}`` где team_id это JID команды для которой создать websocket. Это значит что для каждой команды нужен отдельное websocket соединение чтобы получать события из нескольких команд.

source: ``web.tada.team`` can be substituted for custom domain.
ru: ``web.tada.team`` может быть заменено на другой домен.

source: Connecting to websocket requires authentication. To authenticate you must include the HTTP header ``token`` with your bot token in the connection handshake. See :doc:`/bot_howto` on how to acquire bot token.
ru: Для соединения с websocket необходима авторизация. Для авторизации нужно включить HTTP header ``token`` с токеном бота в запросе на соединение. Смотрите :doc:`/bot_howto` o том как создать токен бота.

source: Event JSON objects
ru: JSON объекты событий

source: All events sent to or from server should be wrapped in an event object.
ru: Все события с сервера или на сервер должны быть завернуты в объект события.

source: Event object has following fields:
ru: Объект события имеет следующие поля:

source: ``event`` (string) - Name of event. For example, ``"client.activity"``.
ru: ``event`` (string) - Название события. Например, ``"client.activity"``.

source: ``confirm_id`` (string) - Mostly used for debugging. Should be set to any random string.
ru: ``confirm_id`` (string) - В основном используется для отладки. Должно быть случайная строка.

source: ``params`` (object) - The actual event object.
ru: ``params`` (object) - Сам объект события.

source: Example:
ru: Пример:

source: This is a :ref:`client.activity` event sent by client to indicate that user is AFK.
ru: Это пример :ref:`client.activity` события отправленного клиентом чтобы поставить статус AFK.

source: List of events
ru: Список событий

source: :ref:`Client events`. These events the clients can send to server.
ru: :ref:`Client events`. Эти события клиент может отправить на сервер.

source: :ref:`Server events`. These events server sends to clients.
ru: :ref:`Server events`. Эти события приходят с сервера.
